id: 01e6fb1c-7843-4f35-9b12-2c5a570feee7
name: Should synch
description: |
  'This detection uses Normalized Process Events to hunt Certutil activities'

requiredDataConnectors: []
tactics:
  - CommandAndControl
relevantTechniques:
  - T1105

query: |
  imProcessCreate
  | where Process has "certutil.exe"
  // Uncomment the next line and add your commandLine Whitelisted/ignore terms.For example "urlcache"
  // | where CommandLine !contains ("urlcache") 
  | extend HostCustomEntity = Dvc, AccountCustomEntity = User

entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
  - entityType: Host
    fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity
